const wordList=[
{"日文":"ちゆうごくじん", "中文":"中国人"},
{"日文":"にほんじん", "中文":"日本人"},
{"日文":"かんこくじん", "中文":"韩国人"},
{"日文":"がくせい", "中文":"学生"},
{"日文":"アメリカじん", "中文":"美国人"},
{"日文":"フランスじん", "中文":"法国人"},
{"日文":"せんせい", "中文":"老师"},
{"日文":"わたし", "中文":"我"},
{"日文":"おはようぐざいます", "中文":"早上好"},
{"日文":"こんにちわ", "中文":"你好"},
{"日文":"さようなら", "中文":"再见"},
{"日文":"こんばんわ", "中文":"晚上好"},
{"日文":"おやすみなさい", "中文":"晚安"},
{"日文":"すみません", "中文":"对不起"},
{"日文":"ありがとうございます", "中文":"谢谢"},
{"日文":"いただきます", "中文":"我吃了"},
{"日文":"ごちそうまでしだ", "中文":"吃好了"},
{"日文":"りゆうがくせい", "中文":"留学生"},
{"日文":"きようじゆ", "中文":"教授"},
{"日文":"しやいん", "中文":"职员"},
{"日文":"かいしやいん", "中文":"公司职员"},
{"日文":"てんいん", "中文":"店员"},
{"日文":"けんしゆうせい", "中文":"进修生"},
{"日文":"きぎよう", "中文":"企业"},
{"日文":"だいがく", "中文":"大学"},
{"日文":"ちち", "中文":"(我)父亲"},
{"日文":"かちよう", "中文":"科长"},
{"日文":"しやちよう", "中文":"社长"},
{"日文":"でむかえ", "中文":"迎接"},
{"日文":"あのひと", "中文":"那个人"},
{"日文":"あなだ", "中文":"你"},
{"日文":"どうも", "中文":"很，非常"},
{"日文":"はい", "中文":"是的"},
{"日文":"いいえ", "中文":"不是"},
{"日文":"り", "中文":"[人名]李"},
{"日文":"おう", "中文":"[人名]王"},
{"日文":"ちよう", "中文":"[人名]张"},
{"日文":"もり", "中文":"[人名]森"},
{"日文":"はやし", "中文":"[人名]林"},
{"日文":"おの", "中文":"[人名]小野"},
{"日文":"よしだ", "中文":"[人名]吉田"},
{"日文":"なかむら", "中文":"[人名]中村"},
{"日文":"たろう", "中文":"[人名]太郎"},
{"日文":"キム", "中文":"[人名]金"},
{"日文":"どうぞ", "中文":"请"},
{"日文":"スミス", "中文":"[人名]史密斯"},
{"日文":"はじめましで", "中文":"初次见面"},
{"日文":"こちらこそ", "中文":"我才要"},
{"日文":"そうです", "中文":"是(这样)"},
{"日文":"ちがいます", "中文":"不是"},
{"日文":"わかりません", "中文":"不知道"},









]

wordList.sort((a, b)=> a.日文.length - b.日文.length);

export default wordList;